# SetImageControlPath

## Description
Sets the image control path for the specified layout manager image control.  Use with CreateImageControl.

```pascal
FUNCTION SetImageControlPath(
				nDialogID    : LONGINT;
				nComponentID : LONGINT;
				strPath      : STRING): BOOLEAN;
```

```python
def vs.SetImageControlPath(nDialogID, nComponentID, strPath):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT|   |
|nComponentID|LONGINT|   |
|strPath|STRING|   |

## Version
Availability: from VectorWorks13.0

## Category
* Dialogs - Modern